using Lab1_2026.Models;

namespace Lab1_2026.Services
{
    public class TestService
    {
        public Question[] GetShubertQuestions()
        {
            return new Question[]
            {
                new Question { Id = 1, Text = "Чи перевищили б Ви встановлену швидкість, щоб швидше надати необхідну медичну допомогу тяжкохворій людині?" },
                new Question { Id = 2, Text = "Чи погодилися б Ви заради гарного заробітку брати участь у небезпечній та тривалій експедиції?" },
                new Question { Id = 3, Text = "Чи стали б Ви на шляху небезпечного зломщика, що тікає?" },
                new Question { Id = 4, Text = "Чи могли б Ви їхати на підніжці товарного вагона за швидкості понад 100 км/год?" },
                new Question { Id = 5, Text = "Чи можете Ви наступного дня після безсонної ночі нормально працювати?" },
                new Question { Id = 6, Text = "Чи стали б Ви першим переходити дуже холодну річку?" },
                new Question { Id = 7, Text = "Чи позичили б Ви другу велику суму грошей, будучи не зовсім впевненим, що він зможе Вам повернути ці гроші?" },
                new Question { Id = 8, Text = "Увійшли б Ви разом із приборкувачем у клітку з левами при його запевненні, що це безпечно?" },
                new Question { Id = 9, Text = "Чи могли б Ви під чиїмось керівництвом залізти на високу фабричну трубу?" },
                new Question { Id = 10, Text = "Чи могли б Ви без тренування керувати вітрильним човном?" },
                new Question { Id = 11, Text = "Чи ризикнули б Ви схопити за вуздечку коня, що біжить?" },
                new Question { Id = 12, Text = "Чи могли б Ви після 5 пляшок міцного пива їхати велосипедом?" },
                new Question { Id = 13, Text = "Чи могли б Ви зробити стрибок з парашутом?" },
                new Question { Id = 14, Text = "Чи могли б Ви при необхідності проїхати без квитка потягом далекого прямування?" },
                new Question { Id = 15, Text = "Чи могли б Ви зробити автотурне, якби за кермом сидів Ваш знайомий, який зовсім недавно був у важкій дорожній пригоді?" },
                new Question { Id = 16, Text = "Чи могли б Ви з 10-метрової висоти стрибнути на намет пожежної команди?" },
                new Question { Id = 17, Text = "Чи могли б Ви, щоб позбутися затяжної хвороби з постільним режимом, піти на небезпечну для життя операцію?" },
                new Question { Id = 18, Text = "Чи могли б Ви зістрибнути з підніжки товарного вагона, що рухається зі швидкістю 50 км/год?" },
                new Question { Id = 19, Text = "Чи могли б Ви, як виняток, разом із сімома іншими людьми, піднятися в ліфті, розрахованому лише на шість осіб?" },
                new Question { Id = 20, Text = "Чи могли б Ви за велику грошову винагороду перейти із зав'язаними очима жваве вуличне перехрестя?" },
                new Question { Id = 21, Text = "Чи взялися б Ви за небезпечну для життя роботу, якби за неї добре платили?" },
                new Question { Id = 22, Text = "Чи могли б Ви після трьох склянок горілки обчислювати відсотки?" },
                new Question { Id = 23, Text = "Чи могли б Ви за вказівкою Вашого начальника взятися за високовольтний провід, якби він запевнив Вас, що провід знеструмлений?" },
                new Question { Id = 24, Text = "Чи могли б Ви після деяких попередніх пояснень керувати вертольотом?" },
                new Question { Id = 25, Text = "Чи могли б Ви, маючи квитки, але без грошей та продуктів, здійснити поїздку на поїзді далекого прямування?" }
            };
        }

        public string InterpretResult(int score)
        {
            if (score < -30) return "Занадто обережні";
            else if (score >= -10 && score <= 10) return "Середні значення (у нормі)";
            else if (score > 20) return "Схильні до ризику";
            else return "Проміжний рівень схильності до ризику";
        }
    }
}