namespace Lab1_2026.Services
{
    public class TestService
    {
        public string[] GetQuestions()
        {
            return new string[]
            {
                "1. Чи перевищили б Ви встановлену швидкість, щоб швидше надати необхідну медичну допомогу тяжкохворій людині?",
                "2. Чи погодилися б Ви заради гарного заробітку брати участь у небезпечній та тривалій експедиції?",
                "3. Чи стали б Ви на шляху небезпечного зломщика, що тікає?",
                "4. Чи могли б Ви їхати на підніжці товарного вагона за швидкості понад 100 км/год?",
                "5. Чи можете Ви наступного дня після безсонної ночі нормально працювати?",
                "6. Чи стали б Ви першим переходити дуже холодну річку?",
                "7. Чи позичили б Ви другу велику суму грошей, будучи не зовсім впевненим, що він зможе Вам повернути ці гроші?",
                "8. Увійшли б Ви разом із приборкувачем у клітку з левами при його запевненні, що це безпечно?",
                "9. Чи могли б Ви під чиїмось керівництвом залізти на високу фабричну трубу?",
                "10. Чи могли б Ви без тренування керувати вітрильним човном?",
                "11. Чи ризикнули б Ви схопити за вуздечку коня, що біжить?",
                "12. Чи могли б Ви після 5 пляшок міцного пива їхати велосипедом?",
                "13. Чи могли б Ви зробити стрибок з парашутом?",
                "14. Чи могли б Ви при необхідності проїхати без квитка потягом далекого прямування?",
                "15. Чи могли б Ви зробити автотурне, якби за кермом сидів Ваш знайомий, який зовсім недавно був у важкій дорожній пригоді?",
                "16. Чи могли б Ви з 10-метрової висоти стрибнути на намет пожежної команди?",
                "17. Чи могли б Ви, щоб позбутися затяжної хвороби з постільним режимом, піти на небезпечну для життя операцію?",
                "18. Чи могли б Ви зістрибнути з підніжки товарного вагона, що рухається зі швидкістю 50 км/год?",
                "19. Чи могли б Ви, як виняток, разом із сімома іншими людьми, піднятися в ліфті, розрахованому лише на шість осіб?",
                "20. Чи могли б Ви за велику грошову винагороду перейти із зав'язаними очима жваве вуличне перехрестя?",
                "21. Чи взялися б Ви за небезпечну для життя роботу, якби за неї добре платили?",
                "22. Чи могли б Ви після трьох склянок горілки обчислювати відсотки?",
                "23. Чи могли б Ви за вказівкою Вашого начальника взятися за високовольтний провід, якби він запевнив Вас, що провід знеструмлений?",
                "24. Чи могли б Ви після деяких попередніх пояснень керувати вертольотом?",
                "25. Чи могли б Ви, маючи квитки, але без грошей та продуктів, здійснити поїздку на поїзді далекого прямування?"
            };
        }

        public string InterpretResult(int score)
        {
            if (score < -30) return "Надто обережні";
            else if (score >= -10 && score <= 10) return "Середні значення";
            else if (score > 20) return "Схильні до ризику";
            else return "Проміжні значення";
        }
    }
}